Repository: technologiescollege/EduCle
Catalog: MyApps/Matieres/Technologie/s2p/s2p/languages/*-Français.po
Languages: fr

source: Communication with %1 was disconnected
fr: La communication avec %1 a été interrompue

source: %1 is already running
fr: % 1 est déjà en cours d'exécution

source: %1 is connected
fr: 1% est connecté

source: All Files
fr: Tous les fichiers

source: Application folder does not exist
fr: Le dossier application n'existe pas

source: Application subfolder does not exist
fr: Le sous-dossier application n'existe pas

source: Attempting to communicate with %1
fr: Tentative de communication avec% 1

source: Attempting to communicate with PICAXE
fr: Tentative de communication avec PICAXE

source: Bluetooth Setup
fr: Configuration Bluetooth

source: Cannot create Scratch Projects sub-folder in documents folder
fr: Impossible de créer un sous-dossier de Projet Scratch dans le dossier documents

source: Cannot find
fr: Impossible de trouver

source: Cannot find application folder
fr: Impossible de trouver le dossier applications

source: Cannot find application subfolder
fr: Impossible de trouver le sous-dossier application

source: Cannot find file
fr: Impossible de trouver le fichier

source: Cannot open port %1 (%2,N,8,1)
fr: Impossible d'ouvrir le port %1 (%2,N,8,1)

source: Cannot open serial port %1 (%2,N,8,1)
fr: Impossible d'ouvrir le port %1 (%2,N,8,1)

source: Clearing Data ...
fr: Effacement des données

source: Clearing Data for %1 ...
fr: Effacement des données pour %1 ...

source: Clearing Data for %1 on %2 ...
fr: Effacement des données pour %1 sur %2 ...

source: Clearing Data on %1 ...
fr: Effacement des données sur %1 ...

source: Clearing Program ...
fr: Effacement du programme

source: Clearing Program for %1 ...
fr: Effacement du programme pour %1 ...

source: Clearing Program for %1 on %2 ...
fr: Effacement du programme pour %1 sur %2 ...

source: Clearing Program on %1 ...
fr: Effacement du programme sur %1 ...

source: Clearing Table ...
fr: Effacement du tableau

source: Clearing Table for %1 ...
fr: Effacement du tableau pour %1 ...

source: Clearing Table for %1 on %2 ...
fr: Effacement du tableau pour %1 sur %2 ...

source: Clearing Table on %1 ...
fr: Effacement du tableau sur %1 ...

source: COM Port
fr: Port COM

source: Communicating with PICAXE
fr: En cours de communication avec PICAXE

source: Communications with PICAXE were disconnected
fr: Les communications avec PICAXE ont été interrompues

source: Connect power now ...
fr: Mettre sous tension

source: Connect power now for %1 ...
fr: Mettre sous tension à présent pour %1 sur %2 ...

source: Connect power now for %1 on %2 ...
fr: Mettre sous tension à présent pour %1 sur %2 ...

source: Connect power now on %1 ...
fr: Mettre sous tension à présent sur %1 ...

source: Connection
fr: Connexion

source: Continue
fr: Poursuivre

source: Convert .sb2 file and display
fr: Convertir le fichier .sb2 et l'afficher

source: Convert .sb2 file to BASIC file
fr: Convertir le fichier .sb2 en fichier BASIC

source: Convert .sb2 file to clipboard
fr: Convertir le fichier .sb2 vers le presse-papier

source: Converted Basic has been placed in clipboard
fr: Le fichier convertit en BASIC a été placé dans le presse-papier

source: Converted Basic has been saved to disk as %1
fr: Le fichier convertit en BASIC a été sauvegardé avec le nom %1

source: Could not attach to GUID: '%1'
fr: Impossible de lier au GUIDE : '%1'

source: Could not create zip file
fr: Impossible de créer le fichier zip

source: Could not get the name of this device: %1
fr: Impossible d'obtenir le nom de ce périphérique : %1

source: Could not open language file
fr: Impossible d'ouvrir le fichier des langues

source: Documents folder does not exist
fr: Le dossier documents n'existe pas

source: Done!
fr: Terminé !

source: Download Communicator Program
fr: Charger le programme de communication

source: Downloading Data ...
fr: Chargement des données...

source: Downloading Data for %1 ...
fr: Chargement des données de %1 ...

source: Downloading Data for %1 on %2 ...
fr: Chargement des données de %1 dans %2 ...

source: Downloading Data on %1 ...
fr: Chargement des données dans %1 ...

source: Downloading Program ...
fr: Envoi du programme...

source: Downloading Program for %1 ...
fr: Chargement du programme de %1 ...

source: Downloading Program for %1 on %2 ...
fr: Chargement du programme de %1 dans %2 ...

source: Downloading Program on %1 ...
fr: Chargement du programme dans %1 ...

source: Downloading Program/Table ...
fr: Chargement de tableau / programme ...

source: Downloading Program/Table for %1 ...
fr: Chargement de tableau / programme de %1 ...

source: Downloading Program/Table for %1 on %2 ...
fr: Chargement de tableau / programme de %1 dans %2 ...

source: Downloading Program/Table on %1 ...
fr: Chargement de tableau / programme dans %1 ...

source: Dummy task to make program multi-tasking
fr: Tâche virtuelle pour faire un programme multitâches

source: Error:
fr: Erreur :

source: Failed to claim Wedo. Close any other application using WeDo and then restart this application.
fr: Impossible d'appeler WeDo. Fermer toutes les applications utilisant WeDoClose et relancer cette application.

source: Failed to connect to %1 Device.
fr: Impossible de se connecter à l'élément %1

source: Failed to delete file %1
fr: Impossible de supprimer le fichier %1

source: Failed to install callback to %1 Device.
fr: Impossible d'installer les services de l'élément 1%

source: Failed to sendmessagememory to %1 Device
fr: Impossible d'envoyer le message mémoire vers l'élément 1%

source: Failed to sendmessagememory to Wedo.
fr: Impossible d'envoyer le message mémoire vers WeDo

source: File does not exist
fr: Le fichier n'existe pas

source: File MotorControl22.rxe not found on NXT!
fr: Fichier MotorControl22.rxe non trouvé dans NXT!

source: File_DeleteFolder not implemented
fr: File_DeleteFolder non implémenté

source: Found #End - Probably should be #EndIf
fr: #End trouvé - Devrait être probablement #EndIf

source: Generated BASIC
fr: BASIC généré

source: Generated BASIC (also copied to clipboard)
fr: BASIC généré (copié dans le presse-papiers)

source: Have you downloaded the communicator program?
fr: Avez-vous chargé le programme de communication ?

source: Help
fr: Aide

source: Invalid baud rate %1
fr: Vitesse de transmission %1 invalide

source: Invalid Ev3Command.%1(%2)
fr: Ev3Command.%1(%2) invalide

source: Invalid packet at %1
fr: Paquet invalide à %1

source: Lego WeDo found
fr: Lego WeDo trouvé

source: Link established with %1
fr: Liaison établie avec %1

source: MBS plugin registration was not successful
fr: Erreur d'enregistrement du plugin MBS

source: Mode 1: Connected (Control PICAXE from Scratch)
fr: Mode 1 : Connecté (contrôle de PICAXE à partir de Scratch)

source: Mode 2: Remote Run (Convert Scratch to PICAXE BASIC)
fr: Mode 2 : fonctionnement autonome (convertit Scratch en BASIC PICAXE)

source: No documents or desktop folder found
fr: Aucun dossier documents ou bureau trouvé

source: No project.json file in Scratch project file
fr: Pas de fichier project.json dans le fichier projet Scratch

source: Not connected to %1
fr: Non connecté à %1

source: Not connected to PICAXE
fr: Non connecté à PICAXE

source: Oops - Unhandled Exception
fr: Oups ! - Exception non gérée

source: Open
fr: Ouvrir

source: Open Device Manager
fr: Ouvrit le gestionnaire de périphériques

source: Open Scratch Program File
fr: Ouvrir le fichier de programme Scratch

source: PICAXE chip is not communicating
fr: Le microcontrôleur PICAXE ne communique pas

source: PICAXE chip is not communicating.
fr: Le microcontrôleur PICAXE ne communique pas.

source: Please install libhid (sudo apt-get install libhid-dev)
fr: Veuillez installer libhid (sudo apt-get install libhid-dev)

source: Please send this information to picaxe@rev-ed.co.uk.
fr: Veuillez envoyer ce message à icaxe@rev-ed.co.uk.

source: Program
fr: Exécuter

source: Program PICAXE from .sb2 file
fr: Programmer PICAXE à partir du fichier .sb2

source: Programming Failed
fr: La programmation a échoué

source: Quit
fr: Quitter

source: Refresh Port List
fr: Actualiser les ports COM

source: S2Bot plugin not communicating with %1
fr: le plugin S2Bot ne communique pas avec %1

source: Save File
fr: Enregistrer le fichier

source: Save Scratch Extension File
fr: Enregistrer le fichier avec l'extension Scratch

source: Scratch 2.0 Project Files
fr: Fichier projet Scratch 2.0

source: Scratch project file does not exist
fr: Le fichier projet Scratch 2.0 n'existe pas

source: Scratch project file has no content
fr: Le fichier projet Scratch 2.0 est vide

source: Scratch to Bot
fr: Scratch vers Bot

source: Scratch to PICAXE
fr: Scratch vers PICAXE

source: Scraxe Board support coming soon!
fr: Assistance carte Scraxe Board bientôt disponible !

source: Search for bluetooth
fr: Recherche Bluetooth

source: Search for USB
fr: Recherche USB

source: Searching for hardware ...
fr: Recherche d'un matériel

source: Searching for hardware for %1 ...
fr: Recherche d'un matériel avec %1

source: Searching for hardware for %1 on %2 ...
fr: Recherche d'un matériel avec %1 sur %2

source: Searching for hardware on %1 ...
fr: Recherche d'un matériel sur %1

source: Select Folder
fr: Sélectionner le dossier

source: Setup
fr: Configuration

source: Shell has completed
fr: Construction terminée

source: Show PDF Document
fr: Voir le document PDF

source: Successfully programmed %1
fr: Programmé avec succès %1

source: Target
fr: Cible

source: Template for New Scratch Project
fr: Modèle pour un nouveau projet Scratch

source: The %1 is not communicating
fr: Le %1 ne communique pas

source: The following bluetooth devices exist on this computer - %1
fr: Les périphériques Bluetooth suivants sont sur cet ordinateur - %1

source: The following tty devices exist on this computer - %1
fr: Le périphérique tty suivant est sur cet ordinateur - %1

source: The following USB devices exist on this computer - %1
fr: Les périphériques USB suivants sont sur cet ordinateur - %1

source: The following USB Serial Devices exist on this computer - %1
fr: Les périphériques Série USB suivants sont sur cet ordinateur - %1

source: The following USB<>Serial devices exist on this computer - %1
fr: Les périphériques Série <>USB suivants sont sur cet ordinateur - %1

source: The PICAXE is not communicating
fr: Le PICAXE ne communique pas

source: Try 'sudo adduser <your_username> dialout' and then a system reboot.
fr: Essayez 'sudo adduser <your_username> dialout' puis redémarrez le système.

source: Unable to connect to %1
fr: Impossible de se connecter à %1

source: Unable to extract project.json file from Scratch project file
fr: Impossible d'extraire le fichier project.json à partir du fichier projet Scratch

source: Unable to find %1
fr: impossible de trouver %1

source: Unable to find any bluetooth devices
fr: impossible de trouver des périphériques Bluetooth

source: Unable to find any Lego devices
fr: impossible de trouver des périphériques Lego

source: Unable to find any ttyUSB devices
fr: impossible de trouver des périphériques ttyUSB

source: Unable to find any USB devices
fr: impossible de trouver des périphériques USB

source: Unable to identify any USB Serial Devices
fr: impossible d'identifier des périphériques série USB

source: Unable to open port to %1
fr: impossible d'ouvrir le port à %1

source: Unable to open serial port to %1
fr: impossible d'ouvrir le port série à %1

source: Unable to process Scratch project file
fr: impossible d'exécuter le projet Scratch

source: USB Serial Port
fr: Port Série

source: USB Setup
fr: Configuration USB

source: Wedo has been removed!
fr: Wedo a été supprimé !

source: Wedo not found. Insert WeDo and then close/restart this application.
fr: Wedo non trouvé. Insérer WeDo puis quitter et redémarrer cette application

source: WeDo support is currently only for 32 bit Linux systems.
fr: WeDo est pour l'instant compatible seulement avec les systèmes Linux 32 bits.

source: Wrong PICAXE type connected - %1 connected
fr: Mauvais type de PICAXE connecté - %1 connecté

source: You do not have permission to open the Wedo device, so you must add a new udev rule.
fr: Vous n'avez pas le permission d'ouvrir le périphérique WeDo, vous devez ajouter une nouvelle règle udev.

source: Please Wait...
fr: Veuillez patienter...

source: Scanning for serial ports
fr: Rechercher des ports COM

source: Connect
fr: Connecter

source: Disconnect
fr: Déconnecter

source: Convert
fr: Convertir

source: turn output %m.outputPin on
fr: activer la sortie %m.outputPin

source: turn output %m.outputPin off
fr: désactiver la sortie %m.outputPin

source: turn output %m.outputPin on for %n secs
fr: activer la sortie %m.outputPin pendant %n secs

source: turn %m.motor on
fr: lancer turn %m.motor

source: turn %m.motor off
fr: arrêter turn %m.motor

source: turn %m.motor on for %n secs
fr: lancer %m.motor pendant %n secs

source: set %m.motor direction to %m.motorDirection
fr: Mettre la direction moteur %m.motor à %m.motorDirection

source: play note %n for %n on %m.soundPin
fr: jouer la note %n pendant %n sur %m.soundPin

source: setup sensor %m.inputPin as %m.sensorType
fr: configurer le capteur %m.inputPin avec le type %m.sensorType

source: setup i2c as %m.i2cSensors
fr: Configurer l'i2c pour %m.i2cSensors

source: reset
fr: RAZ

source: move servo %m.servoPin to position %n
fr: Positionner le servo %m.servoPin à %n

source: setup sensor %m.adcPin as %m.adcType
fr: configurer le capteur %m.adcPin avec le type %m.adc

source: write %n to eeprom location %n
fr: écrire %n à la position eeprom %n

source: read eeprom location %n
fr: Lire l'eeprom à l'emplacement %n

source: eeprom data
fr: Donnée eeprom

source: motor A
fr: Moteur A

source: motor B
fr: Moteur B

source: motor C
fr: Moteur C

source: motor D
fr: Moteur D

source: switch
fr: contact

source: analogue
fr: Analogique

source: temperature
fr: température

source: ultrasonic
fr: ultrasons

source: infrared
fr: Infrarouge

source: touch
fr: tactile

source: this way
fr: de cette façon

source: that way
fr: comme cela

source: reverse
fr: inverser

source: None
fr: Aucun

source: NXT Color (MS1038)
fr: Capteur de couleur NXT (MS1038)

source: NXT Temp (9749)
fr: Capteur de température NXT (9749)

source: result1
fr: résultat1

source: result2
fr: résultat2

source: result3
fr: résultat3

source: result4
fr: résultat4

source: result5
fr: résultat5

source: result6
fr: résultat6

source: sensor A.0
fr: capteur A.0

source: sensor A.1
fr: capteur A.1

source: sensor A.2
fr: capteur A.2

source: sensor A.3
fr: capteur A.3

source: sensor A.4
fr: capteur A.4

source: sensor A.5
fr: capteur A.5

source: sensor A.6
fr: capteur A.6

source: sensor A.7
fr: capteur A.7

source: sensor B.0
fr: capteur B.0

source: sensor B.1
fr: capteur B.1

source: sensor B.2
fr: capteur B.2

source: sensor B.3
fr: capteur B.3

source: sensor B.4
fr: capteur B.4

source: sensor B.5
fr: capteur B.5

source: sensor B.6
fr: capteur B.6

source: sensor B.7
fr: capteur B.7

source: sensor C.0
fr: capteur C.0

source: sensor C.1
fr: capteur C.1

source: sensor C.2
fr: capteur C.2

source: sensor C.3
fr: capteur C.3

source: sensor C.4
fr: capteur C.4

source: sensor C.5
fr: capteur C.5

source: sensor C.6
fr: capteur C.6

source: sensor C.7
fr: capteur C.7

source: sensor D.0
fr: capteur D.0

source: sensor D.1
fr: capteur D.1

source: sensor D.2
fr: capteur D.2

source: sensor D.3
fr: capteur D.3

source: sensor D.4
fr: capteur D.4

source: sensor D.5
fr: capteur D.5

source: sensor D.6
fr: capteur D.6

source: sensor D.7
fr: capteur D.7

source: There is a problem with S2P
fr: Il y a un problème avec S2P

source: S2P plugin not communicating with PICAXE
fr: Le plugin S2P ne communique pas avec PICAXE

source: PICAXE Connected
fr: PICAXE connecté

source: %1 during %2
fr: %1 pendant %2

source: Saved Scratch program is intended for %1
fr: Le programme sauvegardé s'adresse à %1

source: Extraneous content at end of file
fr: Contenu supplémentaire en fin de fichier

source: Program contains no executable blocks
fr: Ce programme ne contient pas de blocs exécutables

source: Cannot have multiple interrupts
fr: Impossible d'avoir des interruptions multiples

source: Only four Scratch event blocks allowed for %1
fr: Seulement quatre blocs d'évènement Scratch autorisés pour %1

source: Only eight Scratch event blocks allowed for %1
fr: Seulement huit blocs d'évènement Scratch autorisés pour %1

source: Only one Scratch event block allowed on PICAXE devices without multi-tasking
fr: Seulement un bloc d'évènement Scratch autorisé sur les microcontrôleurs PICAXE non multitâches

source: Unknown operator
fr: Opérateur inconnu

source: Cannot configure analogue input on pin %1
fr: impossible de configurer la broche %1 en entrée analogique

source: Duplicate menu item
fr: Dupliquer un élément du menu

source: Pin %1 cannot be used for %2
fr: Le broche %1 ne peut être utilisée pour %2

source: Duplicate variable definition
fr: Dupliquer le définition de la variable

source: Unknown unary operator
fr: Opérateur unaire inconnu

source: Unknown binary operator
fr: Opérateur binaire inconnu

source: No available byte-sized loop variables
fr: Pas de variables d'itérations d'un octet disponibles

source: No available loop variables
fr: Pas de variables d'itérations disponibles

source: Command not supported
fr: Commande non prise en compte

source: Unknown command
fr: Commande inconnue

source: PICAXE event not supported
fr: Evènement PICAXE non pris en compte

source: Unknown motor
fr: Moteur inconnu

source: Unknown motor direction
fr: Direction moteur inconnue

source: PICAXE command not supported
fr: Commande PICAXE non prise en compte

source: Cannot have multiple sensor types on pin %1
fr: Impossible d'avoir des capteurs de types différents sur la broche %1

source: %1 and %2
fr: %1 et %2

source: Unknown PICAXE command
fr: Commande PICAXE inconnue

source: No temporary variables available
fr: Pas de variables temporaires disponibles

source: %1 expected
fr: %1 attendu
